"""На столе лежат n монеток. Некоторые из них лежат вверх решкой, 
а некоторые – гербом. Определите минимальное число монеток, 
которые нужно перевернуть, чтобы все монетки были повернуты 
вверх одной и той же стороной. 
Выведите минимальное количество монет,
которые нужно перевернуть"""

N=int(input("Введите число монеток на столе: "))
count_orel=0
count_resh=0
for i in range(N):
    coin=input("Введите, как лежит монета: орел или решка: ")
    if coin=='орел':
        count_orel+=1
    if coin=='решка':
        count_resh+=1
    else:
        print("Вы ввели неверное значение ")
if  count_orel> count_resh:
    print(count_resh)
else:
    print(count_orel)