"""В некоторой школе решили набрать 
три новых математических класса
и оборудовать кабинеты для них новыми партами. 
За каждой партой может сидеть два учащихся. 
Известно количество учащихся в каждом из трех классов. 
Выведите наименьшее число парт, которое нужно приобрести для них. 
Input: 20 21 22(ввод чисел НЕ в одну строку) 
Output: 32"""

firstClass = int(input("Введите количество учеников в первом классе: "))
secondClass = int(input("Введите количество учеников вво втором классе: "))
thirdClass = int(input("Введите количество учеников в третьем классе: "))

s1=firstClass//2+firstClass%2
s2=secondClass//2+secondClass%2
s3=thirdClass//2+thirdClass%2
print(s1+s2+s3)

#or

s1=(firstClass+1)//2
s2=(secondClass+1)//2
s3=(thirdClass+1)//2
print(s1+s2+s3)
