"""Петя, Катя и Сережа делают из бумаги журавликов. 
Вместе они сделали S журавликов. Сколько журавликов сделал каждый ребенок, 
если известно, что Петя и Сережа сделали одинаковое количество журавликов,
а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?"""


S=int(input("Введите четное число журавликов: "))
sergeyBirds=S//6
petrBirds=sergeyBirds
kateBirds=(sergeyBirds+petrBirds)*2
print(f"Сергей сделал {sergeyBirds} журавликов")
print(f"Петя сделал {petrBirds} журавликов")
print(f"Катя сделала {kateBirds} журавликов")

