"""Дан массив, состоящий из целых чисел. 
Напишите программу, которая подсчитает количество 
элементов массива, больших предыдущего 
(элемента с предыдущим номером) 


Input: [0, -1, 5, 2, 3]
Output: 2 
Пояснение: (-1 < 5, 2 < 3)
Примечание: Пользователь может вводить значения
списка или список задан изначально."""

"""data = [int(i) for i in input("Введите целые числа: ").split()]
result=0
for i in range(len(data)-1):
    if data[i] <data[i+1]:
        result+=1
print(result)"""

data = [int(i) for i in input("Введите целые числа: ").split()]
print(sum([int(data[i+1]> data[i]) for i in range(len(data)-1)]))